# Pandas 001

## Input/Output

In [1]:
import pandas as pd

Dans ce premier notebook nous allons voir la base : comment importer des données, avoir un aperçu, etc.

- commençons par créer un `DataFrame` qui ressemble à ça :

![](https://i.imgur.com/Ax3pp2A.png)

In [2]:
# Votre code
# pd.DataFrame([[30, 21]], columns=['Apples', 'Bananas'])
pd.DataFrame(data={'Apples':[30], 'Bananas':[21]})

   Apples  Bananas
0      30       21

- créer une `Series` qui ressemble à ça :

```
Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object
```

In [28]:
# Votre code
product = ['Flour', 'Milk', 'Egg', 'Spam']
quantity = ['4 cups', ' 1 cup', ' 2 large', '1 can']
pd.Series(quantity, index=product).rename("Dinner")

Flour      4 cups
Milk        1 cup
Egg       2 large
Spam        1 can
Name: Dinner, dtype: object

- charger le ficher CSV : `../test.csv` :

In [29]:
# Votre code
retail = pd.read_csv("retail.csv")
retail.head()

  BranchName  Week  DayWeek  Day  Month  Hour Transaction_Type  Units   Amount
0    MyStore     1        3    2      1     9             Card      3   $54.00
1    MyStore     1        3    2      1    10             Cash      7  -$17.80
2    MyStore     1        3    2      1    10             Card      7   $41.99
3    MyStore     1        3    2      1    11             Card     20  $412.50
4    MyStore     1        3    2      1    12             Cash      1  -$18.00

- sauver un des `DataFrame` précédent sous forme de CSV :

In [31]:
# Votre code
pd.DataFrame([[30, 21]], columns=['Apples', 'Bananas']).to_csv("test.csv")

## Manipulation des `DataFrame`

Nous allons voir comment manipuler les données d'un `DataFrame`. Le dataset que nous allons utiliser répertorie les salaires des joueurs de la NBA sur les saisons 2000 à 2019.

- charger le dataset `NBA_Full_Salaries_2000-2019.csv` :

In [14]:
# Votre code
NBA = pd.read_csv("NBA_Full_Salaries_2000-2019.csv", index_col=0)
NBA.head()

               Name  Year    Salaries  Rank
1  Shaquille O'Neal  2000  17142000.0     1
2     Kevin Garnett  2000  16806000.0     2
3   Alonzo Mourning  2000  15004000.0     3
4      Juwan Howard  2000  15000000.0     4
5    Scottie Pippen  2000  14795000.0     5

- sélectionner la colonne `Name` :

In [15]:
# Votre code
# NBA["Name"]
NBA.Name

1              Shaquille O'Neal
2                 Kevin Garnett
3               Alonzo Mourning
4                  Juwan Howard
5                Scottie Pippen
6                   Karl Malone
7                 Larry Johnson
8                   Gary Payton
9               Rasheed Wallace
10                   Shawn Kemp
11             Damon Stoudamire
12              Antonio McDyess
13                    Ray Allen
14               Antoine Walker
15              Stephon Marbury
16                  Vlade Divac
17                Bryant Reeves
18                Tom Gugliotta
19                Nick Van Exel
20               Elden Campbell
21              Terrell Brandon
22              Derrick Coleman
23               Glenn Robinson
24                  Steve Smith
25                Kerry Kittles
26                 Chris Dudley
27                 Theo Ratliff
28                  Matt Geiger
29                   Jason Kidd
30               Kenny Anderson
                  ...
37391               Joe Chealey
37392                 JP Macura
37393              Rawle Alkins
37394             Billy Preston
37395      Kostas Antetokounmpo
37396               Daryl Macon
37397    DeVaughn Akoon-Purcell
37398              Thomas Welsh
37399              Keenan Evans
37400               Zach Lofton
37401         Marcus Derrickson
37402                Gary Clark
37403           Vincent Edwards
37404             Angel Delgado
37405             Yuta Watanabe
37406               Yante Maten
37407           Duncan Robinson
37408              Trevon Duval
37409             Jared Terrell
37410            Trevon Bluiett
37411             Allonzo Trier
37412             Deonte Burton
37413               Tyler Davis
37414              Troy Caupain
37415              Shake Milton
37416               George King
37417              Drew Eubanks
37418               Jordan Loyd
37419            Wenyen Gabriel
37420                 Nuni Omot
Name: Name, Length: 37420, dtype: object

- sélectionner la première value de cette colonne :

In [39]:
# Votre code
NBA.loc[0, "Name"], NBA.Name[0]

("Shaquille O'Neal", "Shaquille O'Neal")

- sélectionner la première ligne de ce `DataFrame` :

In [27]:
# Votre code
# NBA.head(1)
NBA.iloc[:1,:]

               Name  Year    Salaries  Rank
1  Shaquille O'Neal  2000  17142000.0     1

- sélectionner les 10 premières valeurs de la colonne `Name` :

In [28]:
# Votre code
NBA.loc[:1,:]

               Name  Year    Salaries  Rank
1  Shaquille O'Neal  2000  17142000.0     1